/* 
১. fetch বা async await ইউজ করে API থেকে কিভাবে ডাটা লোড করতে হয়। ডাটা অনেক সময় অনেকভাবে থাকে। সেই ডাটা কোনটা কখন array কখন অবজেক্ট এর ভিতরে আছে। সেটা বুঝে সেই অনুসারে ডাটা দেখানোর সিস্টেম 

২. arrow ফাংশন কিভাবে ইউজ করা হয়

৩. template string এ ডাইনামিকভাবে কিভাবে ডাটা যোগ করতে হয় 

৪. map, forEach, filter, find এইগুলা কখন কোনটা ব্যবহার করতে হয়, এদের মধ্যে পার্থক্য কি 

৫. let, const, var এদের মধ্যে ডিফারেন্স কি, কোন কোনটা ইউজ করতে হয়। 

৬. কোনটা দিয়ে array এর মধ্যে লুপ করতে হয়, কোনটা দিয়ে অবজেক্ট এর মধ্যে লুপ করতে হয়  

৭. spread কিভাবে ইউজ করা হয়, স্প্রেড অপারেটর দিয়ে কিভাবে array কপি করে ফেলে।  

৮. ES6 এর মধ্যে কিভাবে অবজেক্ট বা array এর destructure করে সেটা থেকে ভেরিয়েবল ডিক্লেয়ার করতে হয়। 


*/

/* 
১. GET আর POST এর মধ্যে পার্থক্য কি ?

২. class আর অবজেক্ট কি জিনিস  

৩. bind, call, apply এর পার্থক্য কি ?

৪. জাভাস্ক্রিপ্ট এর this সম্পর্কে ধারণা
*/